[
  {
    "title": "Introduction to Following the Prophet",
    "subpoints": [
      {
        "text": "The importance of prophetic counsel",
        "explanation": "Understanding why prophets are essential in guiding our lives.",
        "scriptures": [
          "Amos 3:7 - Surely the Lord God will do nothing, but he revealeth his secret unto his servants the prophets."
        ],
        "links": [
          "https://www.churchofjesuschrist.org/study/scriptures/ot/amos/3.7"
        ]
      },
      {
        "text": "Blessings from obedience",
        "explanation": "Obeying prophetic guidance brings personal peace and clarity.",
        "scriptures": [
          "D&C 21:4-6 - Wherefore... thou shalt give heed unto all his words."
        ],
        "links": [
          "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/21.4-6"
        ]
      }
    ],
    "summary": "Following prophetic counsel ensures alignment with God's will and brings profound personal blessings.",
    "quotes": [
      "President Russell M. Nelson said, 'Hear Him by following prophetic guidance.'"
    ],
    "story": "In 1965, President Thomas S. Monson was strongly impressed to visit a sick member named Richard in Canada. Acting on prophetic guidance, he visited and brought comfort and peace to the family. This experience emphasizes the blessings of following prophetic promptings even when circumstances seem challenging.",
    "questions": [
      "How can following prophetic counsel bring peace into your life?",
      "What experiences have you had following the prophet’s guidance?"
    ]
  },
  {
    "title": "Challenges and Faith in Following the Prophet",
    "subpoints": [
      {
        "text": "Navigating skepticism",
        "explanation": "Overcoming doubt and skepticism through faith in prophetic guidance.",
        "scriptures": [
          "2 Chronicles 20:20 - Believe in the Lord your God, so shall ye be established; believe his prophets, so shall ye prosper."
        ],
        "links": [
          "https://www.churchofjesuschrist.org/study/scriptures/ot/2-chr/20.20"
        ]
      },
      {
        "text": "Historical examples of faith",
        "explanation": "Early Saints who showed remarkable faith by following prophets through adversity.",
        "scriptures": [
          "D&C 1:38 - What I the Lord have spoken... whether by mine own voice or by the voice of my servants, it is the same."
        ],
        "links": [
          "https://www.churchofjesuschrist.org/study/scriptures/dc-testament/dc/1.38"
        ]
      }
    ],
    "summary": "Faith helps us overcome modern skepticism and recognize the importance of prophetic counsel.",
    "quotes": [
      "Elder Jeffrey R. Holland said, 'Trust God and believe in good things to come.'"
    ],
    "story": "Early Church members faced severe persecution and trials as they followed the counsel to gather together. Despite skepticism and opposition, their faith in prophetic guidance sustained them and strengthened their resolve.",
    "questions": [
      "What can historical examples teach us about following prophets today?",
      "How do you stay faithful amidst skepticism or challenges?",
      "What role does personal revelation play in supporting prophetic guidance?"
    ]
  },
  {
    "title": "Applying Prophetic Teachings Daily",
    "subpoints": [
      {
        "text": "Living by prophetic counsel",
        "explanation": "Making daily decisions based on teachings from prophets.",
        "scriptures": [
          "Mosiah 2:41 - Consider on the blessed and happy state of those that keep the commandments of God."
        ],
        "links": [
          "https://www.churchofjesuschrist.org/study/scriptures/bofm/mosiah/2.41"
        ]
      },
      {
        "text": "Seeking confirmation through prayer",
        "explanation": "Prayer helps us understand and internalize prophetic teachings.",
        "scriptures": [
          "James 1:5 - If any of you lack wisdom, let him ask of God."
        ],
        "links": [
          "https://www.churchofjesuschrist.org/study/scriptures/nt/james/1.5"
        ]
      }
    ],
    "summary": "Applying prophetic counsel enriches our daily decisions, bringing lasting happiness and clarity.",
    "quotes": [
      "President Gordon B. Hinckley said, 'We have a prophet upon the earth today.'"
    ],
    "story": "A young family decided to follow the prophet’s counsel by regularly holding family scripture study and prayer. Over time, they experienced increased unity, peace, and spiritual insights in their home, illustrating the practical benefits of applying prophetic teachings daily.",
    "questions": [
      "What steps can you take today to implement prophetic counsel?",
      "How does prayer help you apply prophetic teachings?",
      "Why is daily consistency important in following prophetic guidance?"
    ]
  }
]
