[
  {
    "id": "UUID-1",
    "title": "Introduction: The Inspiring Faith of Mary Fielding Smith",
    "summary": "An inspiring narrative demonstrating unwavering faith in challenging times.",
    "introStory": "In the pioneer era, Mary Fielding Smith, widow of Hyrum Smith, faced intense adversity during her trek to the Salt Lake Valley. With faith as her compass, she defied impossible odds when her oxen became gravely ill. Rather than accepting defeat, she relied upon fervent prayer and profound trust in divine intervention. Miraculously, her faith was rewarded—her oxen healed, allowing her and her family to complete their journey safely. Her experience illustrates the profound reality that faith in God can overcome the harshest of trials.",
    "subpoints": [
      {
        "id": "UUID-1-1",
        "text": "Mary Fielding Smith’s Faith",
        "explanation": "Her unyielding faith became an inspiration to fellow pioneers and subsequent generations, teaching that belief and action intertwined can yield miraculous results.",
        "scriptures": [
          {
            "id": "UUID-s1",
            "verse": "Hebrews 11:6 - 'But without faith it is impossible to please him...'",
            "link": "https://www.churchofjesuschrist.org/study/scriptures/nt/heb/11.6"
          },
          {
            "id": "UUID-s2",
            "verse": "Alma 32:21 - 'Faith is not to have a perfect knowledge...'",
            "link": "https://www.churchofjesuschrist.org/study/scriptures/bofm/alma/32.21"
          }
        ]
      }
    ],
    "quotes": [
      "Faith is the first principle in revealed religion and the foundation of all righteousness. – Joseph Smith"
    ],
    "questions": [
      "How can Mary's story inspire you in moments of doubt?",
      "What can you do today to nurture your faith similarly?"
    ]
  },
  {
    "id": "UUID-2",
    "title": "Understanding Faith as Action and Power",
    "summary": "Faith requires trust and proactive steps toward God’s promises.",
    "subpoints": [
      {
        "id": "UUID-2-1",
        "text": "Faith as an Active Principle",
        "explanation": "Faith is more than mere belief—it compels us to action, empowering our choices and shaping our destiny.",
        "scriptures": [
          {
            "id": "UUID-s3",
            "verse": "James 2:17 - 'Even so faith, if it hath not works, is dead...'",
            "link": "https://www.churchofjesuschrist.org/study/scriptures/nt/james/2.17"
          },
          {
            "id": "UUID-s4",
            "verse": "Ether 12:6 - 'Ye receive no witness until after the trial of your faith.'",
            "link": "https://www.churchofjesuschrist.org/study/scriptures/bofm/ether/12.6"
          }
        ]
      }
    ],
    "quotes": [
      "True faith is always accompanied by action. – Dieter F. Uchtdorf"
    ],
    "questions": [
      "What practical actions demonstrate your faith daily?",
      "How can recognizing faith as action influence your decisions?"
    ]
  }
 
]
{
  "title": "Example Slide",
  "subpoints": [
    {
      "text": "Faith is essential",
      "scriptures": [
        {
          "verse": "Hebrews 11:1",
          "link": "https://www.churchofjesuschrist.org/study/scriptures/nt/heb/11.1"
        },
        {
          "verse": "Alma 32:21",
          "link": "https://www.churchofjesuschrist.org/study/scriptures/bofm/alma/32.21"
        }
      ]
    }
  ]
}
